Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor (IEnumerable<Double>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumericConstantFilterExpression(
	IEnumerable<double> Values,
	IFormatProvider Provider
)
Public Sub New (
	Values As IEnumerable(Of Double),
	Provider As IFormatProvider
)
Parameters
Values
Type: System.Collections.Generic.IEnumerable<Double>
The value to represent.
Provider
Type: System.IFormatProvider
An IFormatProvider object.
See Also
Reference
NumericConstantFilterExpression Class
NumericConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace